<!DOCTYPE HTML>
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <title>YUI - Bj&ouml;rns studiewebb</title>
  <link href="../stilar/css3.css" rel="stylesheet" type="text/css" media="screen" />
  <link href="../stilar/css3print.css" rel="stylesheet" type="text/css" media="print" />
	<!-- For production -->
	<!-- <script type="text/javascript" src="http://yui.yahooapis.com/3.4.1/build/yui/yui-min.js"></script> -->
	<!-- For local development -->
	<script type="text/javascript" src="../js/yui-min.js"></script>
  <script type="text/javascript" src="../studiewebb2yui.js"></script>
</head>
<body>
<div id="container">
	<div id="header">
		<header>
			<!-- Logotyp och tillika lank till startsida for webbplats -->
			<div id="logotyp">
				<a href="../index.html"><img src="../bilder/logony1.jpg"
					alt="Logotyp f&ouml;r Bj&ouml;rns studiewebb" width="155" height="54" /></a>
			</div>

			<h1>YUI</h1>
		</header>
	</div>

  <!-- *** Meny ************************************************************ -->
  <div id="menyram">
    <ul class="intern">
      <li><a href="./index.html">Inledning</a></li>
    </ul>
    <ul class="intern">
      <li><a href="del1.html">Grundl&auml;ggande</a></li>
      <li><a href="del2.html">Selektorer</a></li>
      <li><a href="del3.html">Urval</a></li>
      <li><a href="del4.html">Uts&ouml;kning</a></li>
      <li><a href="del5.html">Manipulation</a></li>
<!--      <li><a href="del6.html">Effekter</a></li> -->
      <li><a href="del7.html">H&auml;ndelser</a></li>
    </ul>
<!--
    <ul class="intern flerradiglista">
      <li><a href="exempel.html">Exempel</a> p&aring; anv&auml;ndning</li>
    </ul>
    <ul class="intern">
      <li><a href="varnu.html">Var nu?</a></li>
    </ul>
    <ul class="intern flerradiglista">
      <li><a href="beskrivning.html">Beskrivning av jQuery</a> p&aring; denna
        webbplats</li>
      <li><a href="lankar.html">L&auml;nkar</a> till andra webbplatser</li>
    </ul>
-->
    <ul class="tillbakalista flerradiglista">
      <li><a href="../index.html">Till startsida</a> f&ouml;r studiewebb</li>
    </ul>
  </div>

  <!-- *** Innehall ******************************************************** -->
  <div id="innehall">
    <p>P&aring; denna underwebb beskrivs hur man kan ut&ouml;ka webbsidors funktionalitet
      med YUI - ett JavaScript-ramverk. (Beskrivningen utgår från jQuery-versionen 
      av denna underwebb, vilket kan förklara dess annorlunda struktur. :-))</p>

    <p>Exempelsidor i denna underwebb anv&auml;nder HTML version 5, men JavaScript b&ouml;r
      &auml;ven fungera med HTML 4 och XHTML 1. D&auml;rf&ouml;r skrivs &quot;(X)HTML&quot; 
			ist&auml;llet f&ouml;r &quot;HTML och/eller XHTML&quot; f&ouml;r att spara plats och 
			tid. :-)<br />
      <strong>Observera</strong> att denna underwebb anv&auml;nder JavaScript! :-) F&ouml;r att
      kunna anv&auml;nda underwebbens funktion (fr&auml;mst &ouml;ppna nya f&ouml;nster med exempel) kr&auml;vs
      att din webbl&auml;sare st&ouml;djer JavaScript samt att JavaScript <strong>inte</strong> 
			har inaktiverats! Din webbl&auml;sare b&ouml;r &auml;ven st&ouml;dja CSS version 
      3 - den del som stöddes av Internet Explorer 9 och Firefox 4 till 10.</p>

    <p class="kommentar">&Auml;ven denna underwebb (liksom CSS2 och JavaScript) &auml;r 
			designad enbart med stilmallar, d.v.s. inga (X)HTML-tabeller anv&auml;nds f&ouml;r 
			design. Denna webbplats &auml;r &auml;ven designad med HTML 5.</p>
			
		<h2>Sidans inneh&aring;ll</h2>
		
		<ul>
			<li><a href="#om_yui">Om YUI generellt</a>, liksom JavaScript</li>
			<li><a href="#om_underwebb">Om denna underwebb</a></li>
			<li><a href="#referenser">Referenser</a></li>
		</ul>

    <h2 id="om_yui">Om YUI generellt</h2>

    <p>JavaScript har genom &aring;ren f&aring;tt ett d&aring;ligt rykte, bl.a. d&aring; folk inte litar
      p&aring; teknologin (p.g.a. s&auml;kerhetrisker och olika funktion hos olika webbl&auml;sare)
      samt att m&aring;nga designers har &quot;&ouml;veranv&auml;nt&quot; teknologin i tron om att
      deras webbplatser blir &quot;hippare&quot;. St&ouml;det f&ouml;r JavaScript har
      fungerat olika i olika webbl&auml;sare, bl.a. gick Microsoft sin egen v&auml;g
      vilket ledde till att designers var tvungna att skriva JavaScript-kod f&ouml;r
      tv&aring; olika &quot;modeller&quot;. I.o.m. introduktionen av <a href="../js_dom"
			class="externallink">DOM</a> (Document Object Model; och lite tankearbete
      fr&aring;n intelligentare &auml;n mig :-)) s&aring; finns det nu ett angreppss&auml;tt som g&ouml;r att
      vi kan skriva kod f&ouml;r endast en &quot;modell&quot;.</p>

		<p>Detta &auml;r sanning med modifikation, d.v.s. det finns fortfarande en del olikheter
			mellan webbl&auml;sare. F&ouml;r att komma runt detta har ett antal JavaScript-ramverk
			skapats, bl.a. YUI, jQuery, Prototype och MoJo. &Auml;mnet f&ouml;r denna underwebb &auml;r ramverket
      YUI.</p>

    <p>JavaScript-ramverk kan ses som ett enhetligt programmeringsgr&auml;nssnitt 
      (eng. <em>Application Programming Interface</em>, API) i webbl&auml;sare.
      I ramverket finns ett antal f&auml;rdiga funktioner, d.v.s. saker som vi inte beh&ouml;ver 
      skriva funktioner f&ouml;r.</p>
			
		<h3>Om JavaScript generellt</h3>

    <p>Ett <strong>viktigt</strong> begrepp i samband med JavaScript &auml;r &quot;elegant
      nedgradering&quot; (eng. <em>graceful degradation</em>), vilket inneb&auml;r att
      en webbplats alltid ska fungera oavsett vilka teknologier bes&ouml;kares webbl&auml;sare
      st&ouml;djer (CSS, JavaScript, m.m.). JavaScript b&ouml;r allts&aring; anv&auml;ndas f&ouml;r att
      <strong>ut&ouml;ka</strong> upplevelsen av ett bes&ouml;k och <strong>inte</strong>
      hindra bes&ouml;kare fr&aring;n att komma &aring;t delar av webbplatsen. Ytterligare ett intressant
      begrepp &auml;r &quot;diskret JavaScript&quot; (eng. <em>unobtrusive JavaScript</em>),
      d.v.s. JavaScript ska inte vara ett krav f&ouml;r att bes&ouml;ka webbplats samt ska
      inte vara &quot;p&aring;tr&auml;ngande&quot; (reta upp bes&ouml;kare). F&ouml;r att detta ska
      fungera s&aring; m&aring;ste vi f&ouml;rst designa webbplats utan andra teknologier (s&aring; som
      CSS och JavaScript). F&ouml;rst n&auml;r design (eller snarare struktur) &auml;r klar s&aring;
      &auml;ndrar vi presentationen med CSS och funktionaliteten med JavaScript (se sidan
      DOM).</p>
      
    <p class="kommentar">Ett exempel p&aring; detta &auml;r (om de blir klara) de st&ouml;rre exemplen
      som finns sist i sida. De &auml;r en del av sida som d&ouml;ljs med YUI n&auml;r sida 
      laddas och visas i ett &quot;pop-up&quot;-f&ouml;nster n&auml;r bes&ouml;kare klickar p&aring; 
      en knapp.</p>
			
    <p class="tillborjan"><a href="#">Till b&ouml;rjan</a> p&aring; sida</p>

		<h2 id="om_underwebb">Om denna underwebb</h2>
		
		<p>Denna underwebb har delats upp i f&ouml;ljande sidor:</p>
		
		<ul>
			<li><b>Grundl&auml;ggande</b> - kort introduktion till syntax, var man skriver koden samt....</li>
			<li><b>Selektorer</b> - hur man v&auml;ljer ut element att manipulera.</li>
			<li><b>Urval</b> - hur man väljer ut element i DOM-struktur.</li>
      <li><b>Uts&ouml;kning</b> - hur man s&ouml;ker fram t.ex. barn-, syskon- och f&ouml;r&auml;ldraelement.</li>
      <li><b>Manipulation</b> - hur man manipulerar DOM-struktur, t.ex. l&auml;gger till element
        och &auml;ndrar stilar (CSS).</li>
      <li><b>Effekter</b> - hur man anmierar, d&ouml;ljer och visar element.</li>
      <li><b>H&auml;ndelser</b> - hur man kopplar funktioner f&ouml;r att hantera h&auml;ndelser i element.</li>
		</ul>
    
    <h3>Vad som inte behandlas</h3>
    
    <ul>
	  <li><b>Effekter</b> - jag har inte förstått hur dessa fungerar i YUI ännu (plus att de kräver mer jobb
		än i jQuery...).
      <li><b>AJAX</b> - jag har inte kommit s&aring; l&aring;ngt i YUI &auml;nnu. :-) Men mitt m&aring;l &auml;r att 
        &auml;ven behandla detta &auml;mne. (... och jag har sökte en Web 2.0-kurs våren 2012.)</li>
      <li><b>Mer avancerade saker</b> - just nu favoriserar jag serverteknologier, 
        så som PHP och ASP.NET, &ouml;ver JavaScript. :-) (Av &auml;ven denna orsak 
        &auml;r inte beskrivningar kompletta, d.v.s. det &auml;r bara fantasin som 
        s&auml;tter gr&auml;nser f&ouml;r vad man kan g&ouml;ra med YUI.)</li>
    </ul>
    
    <h3>Version av YUI i denna underwebb</h3>
    
    <p>När denna beskrivning började skrivas så gällde version 3.4.1 av YUI,
      d.v.s. det finns en stor risk att ny version släppts och att det finns fler
      (men kanske även mindre) antal metoder. Några metoder kan rent av ha ändrats
      en del, så se dessa beskrivningar som en introduktion och verifiera eventuella
      felaktigheter på den officiella webbplatsens <a href="http://yuilibrary.com/yui/docs/"
      class="externallink">dokumentation</a>.</p>
    
    <h3>Exempel i denna underwebb</h3>
    
    <p>Många exempel ändrar bakgrundsfärg m.h.a. CSS-stilar då detta är mest tydligt. 
      Men YUI kan användas till så mycket mer än att ändra CSS-stilar för element, 
      så använd inte (vissa) exempel som en måttstock på vad som är möjligt.
      :-)</p>
      
    <p>Några exempel är beskrivningar av faktisk funktionalitet i denna underwebb 
      (eller webbplats) - kan det bli mer praktiskt än så? :-)</p>

    <p class="tillborjan"><a href="#">Till b&ouml;rjan</a> p&aring; sida</p>

    <h2 id="referenser">Referenser</h2>

    <p>Nedan finns n&aring;gra webbsidor/-platser som jag anv&auml;nt f&ouml;r att skapa
      denna underwebb.</p>

    <ul>
      <li><a href="http://yuilibrary.com/" class="externallink">YUI:s officiella webbplats</a>.</li>
      <li><a href="http://yuilibrary.com/yui/docs/" class="externallink">YUI:s officiella dokumentation</a>.</li>
    </ul>

    <ul class="foregaendenasta">
      <li>&lt;F&ouml;reg&aring;ende</li>
      <li>Inledning</li>
      <li><a href="del1.html">N&auml;sta&gt;</a></li>
    </ul>
  </div>
  
  <!-- *** Sidfot ********************************************************* -->
  <div id="footer">
    <footer>
      <p id="dokumentinfo"><strong>Skapad av:</strong> Bj&ouml;rn G. D. Persson.
        <strong>Uppdaterad:</strong> 2012-03-10.</p>
    </footer>
  </div>
</div>
</body>
</html>